tap "homebrew/bundle"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "bat"
brew "corepack"
brew "docker-compose"
brew "dotnet"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gcc"
brew "git"
brew "go"
brew "hsd"
brew "ios-deploy"
brew "luarocks"
brew "neovim"
brew "nvm"
brew "openapi-generator"
brew "pandoc"
brew "ruby"
brew "starship"
brew "stow"
brew "tmux"
brew "vim"
brew "watchman"
brew "qmk/qmk/qmk"
cask "android-platform-tools"
cask "bruno"
cask "devutils"
cask "google-chrome"
cask "hyperkey"
cask "inkscape"
cask "insomnia"
cask "kitty"
cask "mactex"
cask "nordvpn"
cask "particle-dev"
cask "qbittorrent"
cask "vanilla"
cask "vysor"
cask "wave"
vscode "bradlc.vscode-tailwindcss"
vscode "ciantic.keymapceditor-vsc"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "gamunu.vscode-yarn"
vscode "golang.go"
vscode "humao.rest-client"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "teabyii.ayu"
vscode "twxs.cmake"
