tap "homebrew/bundle"
tap "jesseduffield/lazygit"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Distributed revision control system
brew "git"
# Post-modern modal text editor
brew "helix"
# Theme for zsh
brew "powerlevel10k"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# TOML toolkit written in Rust
brew "taplo"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Server and cloud storage browser
cask "cyberduck"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
# Terminal built on web technologies
cask "hyper"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "mikestead.dotenv"
vscode "octref.vetur"
vscode "pkief.material-icon-theme"
vscode "teabyii.ayu"
